{
    "title": "Home - Sharan Selvaraj - Software dev | Frontend focussed",
    "professionalExperience": {
            "title": "@professional.experience()",
            "details": [
                {
                    "title": "Cisco, Bangalore",
                    "role": "Software engineer (Grade 008)",
                    "duration": "January 2023 - present",
                    "description": "Worked extensively on Control Hub, Partner Hub portals (admin.cisco.com) and a little on Cisco Contact Center solutions. Added multiple new features, did code review and redesign and improvements of existing UI components. Technologies that were involved here - Angular, Cypress, AngularJS, Typescript, Jest, Java, (HTML/CSS), Momentum UI"
                },
                {
                    "title": "Cisco, Chennai",
                    "role": "Software engineer (Grade 008)",
                    "duration": "January 2020 - present",
                    "description": "Worked extensively on Control Hub and User Settings portals (admin.cisco.com, settings.cisco.com). Worked extensively on the Frontend applications that are part of the Rialto stack - CAP and CUP. Code review, redesign, improvements of existing UI components. Technologies that were involved here - BackboneJS, Vanilla JS based components, Angular, Cypress, Material design."
                },
                {
                    "title": "TalentFil, Chennai",
                    "role": "Software engineer",
                    "duration": "September 2019 - December 2019, left since product was shelved",
                    "description": "Developed initial version of website for a cleaning service run by company with OctoberCMS used for managing content and pages. Worked on the prototype of the application for TalentFil's HR recruitment platform using Justinmind (project shelved). Worked with OctoberCMS (based on Laravel framework), PHP, JavaScript, MySQL, Justinmind."
                },
                {
                    "title": "Intellect Design Arena Ltd, Chennai",
                    "role": "Team lead, IDFC iGTB implementation program / Consultant, Societe Generale India iGTB implementation program",
                    "duration": "September 2014 - December 2016",
                    "description": "Played role of front-end developer in the iGTB banking suite implementation for the IDFC bank (http://www.idfc.com/) and also for the Societe Generale India bank (https://www.societegenerale.asia/en/). Role included developing and implementing customizations for the CBX application (customer facing front-end application), which is part of the iGTB suite provided by Intellect. Development work primarily in JavaScript (custom framework based on the ExtJS framework) and Java, Oracle database, iBatis framework."
                },
                {
                    "title": "PolarisFT, Chennai",
                    "role": "Consultant in the JPMorgan ACCESS Portal project",
                    "duration": "July 2011 - August 2014",
                    "description": "Played role of front-end developer. Role involved adding new features and fixing issues in existing JPMorgan banking suite that was development by PolarisFT."
                }
            ]
        },
    "projects": {
            "title": "@projects()",
            "details": [
                {
                    "title": "Cisco - Partner Hub",
                    "description": "Partner Hub is Cisco's portal for Partners to login and manage creation of new customers, and manage existing customers, add new administrators, control domains etc."
                },
                {
                    "title": "Cisco - Control Hub",
                    "description": "Control Hub (admin.webex.com) is the main administration portal for any customer using Cisco's Webex suite. The customer logs in and does everything from adding new users, setting phone numbers, add new calling features and checking analytics in this one core portal."
                },
                {
                    "title": "Cisco - Rialto stack UI applications",
                    "description": "Worked extensively on the UI applications that are part of the Rialto stack of application at Cisco Chennai. Analyzed, and helped improve JS UI components like Select2 library. Worked on improvements and issues in the Angular-based CUP portal and Backbone based CAP portal."
                },
                {
                    "title": "Intellect design - CBX implementation for IDFC and Societe Generale India banks",
                    "description": "The CBX application from Intellect acts as the front-end web application for back-end applications like the Payments and Collections and allows the bank's customer to access the banking suite. CBX is rendered extensively using a custom framework built over ExtJS JavaScript library and uses various Java technologies."
                },
                {
                    "title": "Polaris - JPMorgan Portal application",
                    "description": "The Portal application that complements the bank's corporate back-end applications by allowing the user to access his investments, manage liquidity etc. from one place. The web based front-end of the application is rendered extensively using the JavaScript library called ExtJS, over which a custom framework has been built, and uses various Java technologies."
                },
                {
                    "title": "Graduation - Keystone project - ThinkMine",
                    "description": "A decentralized peer to peer search engine based on a hierarchical model of the Chord protocol. Has at its core a networking-model based on the Chord protocol."
                }
            ]
        }
}